const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 = 21', () =>{
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ 7 
test('2 + 5 = 7', () =>{
  expect(sum(2,5)).toBe(7);
}); 
// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// 9+6 = 15
test('9 + 6 = 15',() =>{
  expect(sum(9,6)).toBe(15);
});

//3 + 4  = 7
test('3 + 4 = 7',()=>{
 expect(sum(3,4)).toBe(7);
});

// 7 + 3 = 10
test('7 + 3 = 10',() =>{
expect(sum(7,3)).toBe(10);
});